app/views/data_vis/home.html.erb

SELECT  "data_points".* FROM "data_points"  ORDER BY "data_points"."id" ASC LIMIT 1
---
<h1>DataVis#home</h1>
<%= content_tag "div", id:"weatherdata", data:{'weatherdata':DataPoint.all} do %>