app/views/data_vis/weather_station.html.erb


<%= content_tag "div", id:"weatherdata", data:{'weatherdata':DataPoint.all} do %>
---
SELECT "data_points".* FROM "data_points"