app/controllers/data_vis_controller.rb

  def weather_station
    @datapoints = DataPoint.all
---
SELECT "data_points".* FROM "data_points"