app/controllers/data_vis_controller.rb

SELECT  "data_points".* FROM "data_points"  ORDER BY "data_points"."id" ASC LIMIT 1
---
  def home
      @datapoints = DataPoint.all